In [1]:
import numpy as np
import pandas as pd

### Задание 1

In [2]:
a = pd.DataFrame([[0, 1, 1, 0],
             [0, 0, 0, 1],
             [0, 0, 0, 0],
             [0, 0, 0, 0]]).set_index(0)

In [3]:
display(a)

   1  2  3
0
0  1  1  0
0  0  0  1
0  0  0  0
0  0  0  0

In [4]:
a.to_csv('test.csv')

In [5]:
b = pd.read_csv('test.csv')

In [7]:
display(b)

   0  1  2  3
0  0  1  1  0
1  0  0  0  1
2  0  0  0  0
3  0  0  0  0

In [10]:
l = np.array([[1,2],[1,3],[2,4]])

In [13]:
ss = pd.DataFrame(l).set_index(0)

In [14]:
ss

   1
0
1  2
1  3
2  4

In [15]:
ss.to_csv('task1.csv')

In [16]:
check1 = pd.read_csv('task1.csv')

In [17]:
check1

   0  1
0  1  2
1  1  3
2  2  4

### Задание 2